In [ ]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [ ]:
df = pd.read_csv('homeprices.csv')
df.head()

              town  area   price
0  monroe township  2600  550000
1  monroe township  3000  565000
2  monroe township  3200  610000
3  monroe township  3600  680000
4  monroe township  4000  725000

In [ ]:
df.isnull().sum()

town     0
area     0
price    0
dtype: int64

In [ ]:
#One hot encoding using get_dummies
df = pd.get_dummies(df)

In [ ]:
df.head()

   area   price  town_monroe township  town_robinsville  town_west windsor
0  2600  550000                     1                 0                  0
1  3000  565000                     1                 0                  0
2  3200  610000                     1                 0                  0
3  3600  680000                     1                 0                  0
4  4000  725000                     1                 0                  0

In [ ]:
from sklearn.linear_model import  LinearRegression
model1 = LinearRegression()

In [ ]:
#Independent and dependent variable
x = df.drop(['price'] , axis=1)
y =df['price']

In [ ]:
#Train and Test split
from sklearn.model_selection import train_test_split
train_x, test_x ,train_y , test_y = train_test_split(x,y, random_state=56 , test_size=0.25)

In [ ]:
model1.fit(train_x, train_y)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [ ]:
test_predict = model1.predict(test_x)

In [ ]:
compare = pd.DataFrame({
    'true_value':test_y,
    'predicted values':test_predict
})

In [ ]:
compare.head(10)

    true_value  predicted values
8       710000     700789.473684
10      600000     603508.771930
12      695000     687631.578947
3       680000     660570.175439

In [ ]:
#Evaluation of matrics
from sklearn.metrics import mean_squared_error as mse

In [ ]:
k = mse(test_y , test_predict)

In [ ]:
k

132239246.69180228

In [ ]:
train_x.shape
train_x.head()

    area  town_monroe township  town_robinsville  town_west windsor
9   2600                     0                 1                  0
1   3000                     1                 0                  0
11  3100                     0                 1                  0
6   2800                     0                 0                  1
7   3300                     0                 0                  1

In [ ]:
model1.predict([[2500 ,0,1,0]])

array([555438.59649125])

#Exercise

In [ ]:
data1 = pd.read_csv('carprices.csv')

In [ ]:
data1.head()

  Car Model  Mileage  Sell Price($)  Age(yrs)
0    BMW X5    69000          18000         6
1    BMW X5    35000          34000         3
2    BMW X5    57000          26100         5
3    BMW X5    22500          40000         2
4    BMW X5    46000          31500         4

In [ ]:
data1.dtypes

Car Model        object
Mileage           int64
Sell Price($)     int64
Age(yrs)          int64
dtype: object

In [ ]:
data1 = pd.get_dummies(data1)

In [ ]:
data1.head()

   Mileage  Sell Price($)  ...  Car Model_BMW X5  Car Model_Mercedez Benz C class
0    69000          18000  ...                 1                                0
1    35000          34000  ...                 1                                0
2    57000          26100  ...                 1                                0
3    22500          40000  ...                 1                                0
4    46000          31500  ...                 1                                0

[5 rows x 6 columns]

In [ ]:
#indepemdent and dependent variable
x = data1.drop(['Sell Price($)'] , axis=1)
y = data1['Sell Price($)']

In [ ]:
train_x, test_x , train_y,test_y = train_test_split(x, y, random_state=56 , test_size=0.25)

In [ ]:
model1.fit(train_x, train_y)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [ ]:
test_predict = model1.predict(test_x)

In [ ]:
from sklearn.metrics import mean_absolute_error as mae
compare = pd.DataFrame({
    'true_ values':test_y,
    "precited_values":test_predict
})
compare.head()

    true_ values  precited_values
8          12000     13114.240664
10         20000     15817.742739
12         33000     27219.037344
3          40000     41120.630705

In [ ]:

k = mae(test_y , test_predict)
print(k)
train_predict = model1.predict(train_x)
k = mae(train_y , train_predict)
print(k)

3049.5228215767675
1513.7962194559707

In [ ]:

model1.score(train_x , train_y)

0.9171971699692493

In [ ]:
model1.score(test_x, test_y)

0.8879745139778796

In [ ]:
train_x.head()

    Mileage  Age(yrs)  ...  Car Model_BMW X5  Car Model_Mercedez Benz C class
9     67000         6  ...                 0                                1
1     35000         3  ...                 1                                0
11    79000         7  ...                 0                                1
6     52000         5  ...                 0                                0
7     72000         6  ...                 0                                0

[5 rows x 5 columns]

In [ ]:
model1.predict([[4000, 10,0,0,1]])

array([80133.89211618])

In [ ]:
compare1 = pd.DataFrame({
    'train_y':train_y,
    'train_predited':train_predict
})
compare1.head(10)

    train_y  train_predited
9     22000    24350.323651
1     34000    35065.991701
11    21000    18649.676349
6     32000    32340.132780
7     19300    20975.618257
2     26100    25080.663900
0     18000    19380.016598
4     31500    30073.327801
5     29400    27384.248963